app/controllers/admin_controller.rb

  def index
    @articles = Article.count
---
SELECT count(*) AS count_all FROM `articles`