app/controllers/articles_controller.rb

  def create
    @article = Article.new(params[:article])

    respond_to do |format|
      if @article.save
---
INSERT INTO `articles` (`updated_at`, `title`, `description`, `created_at`) VALUES('2009-03-11 03:13:12', 'Game Broadcasts', 'Can\'t make it to a game, remember to listen in on our radio feature. Ian Holmes broadcasts every pass, shot, hit, and goal, so you\'ll never miss a thing!\r\n(Fan Zone -> 88.5 Beach FM ->\r\nor <a href=\"http://www.885thebeach.com/\">Click Here</a>', '2009-03-11 03:13:12')

  def update
    @article = Article.find(params[:id])

    respond_to do |format|
      if @article.update_attributes(params[:article])
---
SELECT * FROM `articles` WHERE (`articles`.`id` = 1)
UPDATE `articles` SET `description` = 'Can\'t make it to a game, remember to listen in on our radio feature. Ian Holmes broadcasts every pass, shot, hit, and goal, so you\'ll never miss a thing!\r\n(Fan Zone -> 88.5 Beach FM ->\r\nor http://www.885thebeach.com/', `updated_at` = '2009-03-11 03:15:17' WHERE `id` = 1