app/controllers/index_controller.rb

  def index
    @articles = Article.search(params[:search], params[:page])
    @sponsors = Sponsor.find(:all, :order => "RAND()", :limit => 5)
---
SELECT * FROM `articles` WHERE (description or title like '%sjajhdkjahsdjahsidjhaids%') ORDER BY id desc LIMIT 0, 5
SELECT count(*) AS count_all FROM `articles` WHERE (title or description like '%%')
SELECT * FROM `sponsors` WHERE (`sponsors`.`id` = '--- :random\n') ORDER BY RAND() LIMIT 5