app/controllers/sponsors_controller.rb

SELECT * FROM `sponsors` WHERE (`sponsors`.`id` = 1)
---
  def show
    @sponsor = Sponsor.find(params[:id])

SELECT * FROM `sponsors` WHERE (`sponsors`.`id` = 4)
---
  def edit
    @sponsor = Sponsor.find(params[:id])

INSERT INTO `sponsors` (`image_url`, `updated_at`, `title`, `created_at`) VALUES('1.jpg', '2009-03-15 04:19:45', 'Arrowsmith: Moving and Storage', '2009-03-15 04:19:45')
---
  def create
    @sponsor = Sponsor.new(params[:sponsor])

    respond_to do |format|
      if @sponsor.save